In [40]:


import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
dataset=pd.read_csv('train.csv')

In [43]:
dataset.head()

   Pclass  Sex  SibSp  Parch     Fare  Survived
0       3    1      1      0   7.2500         0
1       1    0      1      0  71.2833         1
2       3    0      0      0   7.9250         1
3       1    0      1      0  53.1000         1
4       3    1      0      0   8.0500         0

In [4]:
dataset=dataset[['Pclass','Sex','SibSp','Parch','Fare','Survived']]

In [5]:
dataset.head()

   Pclass     Sex  SibSp  Parch     Fare  Survived
0       3    male      1      0   7.2500         0
1       1  female      1      0  71.2833         1
2       3  female      0      0   7.9250         1
3       1  female      1      0  53.1000         1
4       3    male      0      0   8.0500         0

In [6]:
dataset['Sex']=dataset['Sex'].map({'male':1,'female':0})

In [7]:
dataset.head()

   Pclass  Sex  SibSp  Parch     Fare  Survived
0       3    1      1      0   7.2500         0
1       1    0      1      0  71.2833         1
2       3    0      0      0   7.9250         1
3       1    0      1      0  53.1000         1
4       3    1      0      0   8.0500         0

In [8]:
dataset=dataset.dropna()

In [9]:
x=dataset.iloc[:,:-1]
y=dataset.iloc[:,-1]

In [10]:
x

     Pclass  Sex  SibSp  Parch     Fare
0         3    1      1      0   7.2500
1         1    0      1      0  71.2833
2         3    0      0      0   7.9250
3         1    0      1      0  53.1000
4         3    1      0      0   8.0500
..      ...  ...    ...    ...      ...
886       2    1      0      0  13.0000
887       1    0      0      0  30.0000
888       3    0      1      2  23.4500
889       1    1      0      0  30.0000
890       3    1      0      0   7.7500

[891 rows x 5 columns]

In [19]:
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [20]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=1)

In [22]:
x_train

     Pclass  Sex  SibSp  Parch     Fare
301       3    1      2      0  23.2500
309       1    0      0      0  56.9292
516       2    0      0      0  10.5000
120       2    1      2      0  73.5000
570       2    1      0      0  10.5000
..      ...  ...    ...    ...      ...
715       3    1      0      0   7.6500
767       3    0      0      0   7.7500
72        2    1      0      0  73.5000
235       3    0      0      0   7.5500
37        3    1      0      0   8.0500

[712 rows x 5 columns]

In [23]:
x_test

     Pclass  Sex  SibSp  Parch     Fare
862       1    0      0      0  25.9292
223       3    1      0      0   7.8958
84        2    0      0      0  10.5000
680       3    0      0      0   8.1375
535       2    0      0      2  26.2500
..      ...  ...    ...    ...      ...
796       1    0      0      0  25.9292
815       1    1      0      0   0.0000
629       3    1      0      0   7.7333
421       3    1      0      0   7.7333
448       3    0      2      1  19.2583

[179 rows x 5 columns]

In [24]:
y_train

301    1
309    1
516    1
120    0
570    1
      ..
715    0
767    0
72     0
235    0
37     0
Name: Survived, Length: 712, dtype: int64

In [25]:
y_test

862    1
223    0
84     1
680    0
535    1
      ..
796    1
815    0
629    0
421    0
448    1
Name: Survived, Length: 179, dtype: int64

In [28]:
from sklearn.tree import DecisionTreeClassifier

In [29]:
decisiontree=DecisionTreeClassifier()

In [31]:
decisiontree.fit(x_train,y_train)

DecisionTreeClassifier()

In [34]:
y_pred=decisiontree.predict(x_test)

#hold out cross validation

In [36]:
decisiontree.score(x_test,y_test)

0.770949720670391

In [38]:
from sklearn.metrics import accuracy_score

In [39]:
print(accuracy_score(y_test,y_pred))

0.770949720670391